postman/collections/local_900611-68bb4b8a-1f8f-4e1d-9b1a-7b7f4df3fc8c.json

{
	"item": [
		{
			"id": "8a59d1b2-2c00-4cdb-8da2-e67be63de2b5",
			"name": "GetLastTradePrice",
			"request": {
				"description": {
					"content": "",
					"type": "text/plain"
				},
				"url": {
					"path": [
						"stockquote"
					],
					"host": [
						"{{StockQuotePortBaseUrl}}"
					],
					"query": [],
					"variable": []
				},
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8"
					},
					{
						"key": "SOAPAction",
						"value": "http://example.com/GetLastTradePrice"
					}
				],
				"method": "POST",
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				}
			},
			"response": [
				{
					"id": "684a91d7-ca76-4766-8ecb-47109e421933",
					"name": "GetLastTradePrice response",
					"originalRequest": {
						"url": {
							"protocol": "http",
							"path": [
								"stockquote"
							],
							"host": [
								"example",
								"com"
							],
							"query": [],
							"variable": []
						},
						"header": [
							{
								"key": "Content-Type",
								"value": "text/xml; charset=utf-8"
							},
							{
								"key": "SOAPAction",
								"value": "http://example.com/GetLastTradePrice"
							}
						],
						"method": "POST",
						"body": {
							"mode": "raw",
							"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePriceRequest xmlns=\"http://example.com/stockquote.xsd\">\n      <tickerSymbol>string</tickerSymbol>\n    </TradePriceRequest>\n  </soap:Body>\n</soap:Envelope>\n",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						}
					},
					"status": "OK",
					"code": 200,
					"header": [
						{
							"key": "Content-Type",
							"value": "text/xml; charset=utf-8"
						}
					],
					"body": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <TradePrice xmlns=\"http://example.com/stockquote.xsd\">\n      <price>8</price>\n    </TradePrice>\n  </soap:Body>\n</soap:Envelope>\n",
					"cookie": [],
					"_postman_previewlanguage": "xml"
				}
			],
			"event": []
		}
	],
	"event": [],
	"variable": [
		{
			"type": "any",
			"value": "http://example.com",
			"key": "StockQuotePortBaseUrl"
		}
	],
	"info": {
		"_postman_id": "68bb4b8a-1f8f-4e1d-9b1a-7b7f4df3fc8c",
		"name": "local",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"description": {
			"content": "Add your service description here\n",
			"type": "text/plain"
		}
	}
}